# CopyPasteOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CopyPasteOptions Constructor
CopyPasteOptions Class See Also
---
Creates a new instance of a CopyPasteOptions object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public CopyPasteOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
CopyPasteOptions()
```

# See Also
CopyPasteOptions Class
Autodesk.Revit.DB Namespace